olliw42/stm32ll-lib/src/stdstm32-uartf.h
//*******************************************************
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// my stripped down UART standard library
// only ISR, no DMA, no wait and tmo rx functions, no convenience functions
//*******************************************************
// Interface:
//
// #define UARTF_USE_UART1, UARTF_USE_UART2, UARTF_USE_UART3, UARTF_USE_UART3_REMAPPED, UARTF_USE_UART4, UARTF_USE_UART5
// #define UARTF_USE_LPUART1, UARTF_USE_LPUART1_REMAPPED
//
// #define UARTF_BAUD
//
// #define UARTF_USE_TX
// #define UARTF_TXBUFSIZE
// #define UARTF_USE_TX_ISR
// #define UARTF_USE_TX_DMA
//
// #define UARTF_USE_RX
// #define UARTF_RXBUFSIZE
//
// #define UARTF_IRQ_PRIORITY
//
// #define UARTF_USE_RXERRORCOUNT
//
// #define UARTF_RX_CALLBACK_FULL(c)
// #define UARTF_TC_CALLBACK() // ATTENTION: when used, one never should trigger TC isr without a byte written to the tx buffer
//
//*******************************************************
#ifndef STDSTM32_UARTF_H
#define STDSTM32_UARTF_H
#ifdef __cplusplus
extern "C" {
#endif


//-------------------------------------------------------
// Enums
//-------------------------------------------------------
// in order to not introduce hardware dependency upstream
// we define our own enums for parity and stopbits

#ifndef UART_ENUMS
#define UART_ENUMS

typedef enum {
  XUART_PARITY_NO = LL_USART_PARITY_NONE, // XUART_xxx to avoid overlap with HAL
  XUART_PARITY_EVEN = LL_USART_PARITY_EVEN,
  XUART_PARITY_ODD = LL_USART_PARITY_ODD,
  XUART_PARITY_MAKEITU32 = UINT32_MAX,
} UARTPARITYENUM;

typedef enum {
#ifdef LL_USART_STOPBITS_0_5
  UART_STOPBIT_0_5 = LL_USART_STOPBITS_0_5, // not allowed for LPUART, and some STM32F0!
#endif
  UART_STOPBIT_1 = LL_USART_STOPBITS_1,
#ifdef LL_USART_STOPBITS_1_5
  UART_STOPBIT_1_5 = LL_USART_STOPBITS_1_5, // not allowed for LPUART, and some STM32!
#endif
  UART_STOPBIT_2 = LL_USART_STOPBITS_2,
  UART_STOPBIT_MAKEITU32 = UINT32_MAX,
} UARTSTOPBITENUM;

#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if (defined UARTF_USE_TX_ISR) && (!defined UARTF_USE_TX)
  #error UARTF_USE_TX_ISR used without UARTF_USE_TX!
#endif
#if (defined UARTF_USE_RXERRORCOUNT) && (!defined UARTF_USE_RX)
  #error UARTF_USE_RXERRORCOUNT used without UARTF_USE_RX!
#endif

#ifdef UARTF_USE_TX_DMA
  #error UARTF_USE_TX_DMA not supported by this library!
#endif


#ifndef UARTF_BAUD
  #define UARTF_BAUD             115200UL // 9600UL
#endif


#ifdef UARTF_USE_TX_ISR
  #ifndef UARTF_TXBUFSIZE
    #define UARTF_TXBUFSIZE      256 // MUST be 2^N
  #endif
  #if UARTF_TXBUFSIZE < 2
    #error UARTF_TXBUFSIZE must be larger than 1 !
  #elif ((UARTF_TXBUFSIZE & (UARTF_TXBUFSIZE-1)) != 0)
    #error UARTF_TXBUFSIZE must be a power of 2 !
  #endif

  #define UARTF_TXBUFSIZEMASK  (UARTF_TXBUFSIZE-1)

  volatile char uartf_txbuf[UARTF_TXBUFSIZE];
  volatile uint16_t uartf_txwritepos; // pos at which the last byte was stored
  volatile uint16_t uartf_txreadpos; // pos at which the next byte is to be fetched
#endif


#ifdef UARTF_USE_RX
  #ifndef UARTF_RXBUFSIZE
    #define UARTF_RXBUFSIZE      256 //128 //MUST be 2^N
  #endif
  #if UARTF_RXBUFSIZE < 2
    #error UARTF_RXBUFSIZE must be larger than 1 !
  #elif ((UARTF_RXBUFSIZE & (UARTF_RXBUFSIZE-1)) != 0)
    #error UARTF_RXBUFSIZE must be a power of 2 !
  #endif

  #define UARTF_RXBUFSIZEMASK  (UARTF_RXBUFSIZE-1)

  volatile char uartf_rxbuf[UARTF_RXBUFSIZE];
  volatile uint16_t uartf_rxwritepos; // pos at which the last byte was stored
  volatile uint16_t uartf_rxreadpos; // pos at which the next byte is to be fetched

  #ifdef UARTF_USE_RXERRORCOUNT
  volatile uint32_t uartf_errorcnt_rxnoise;
  volatile uint32_t uartf_errorcnt_rxframe;
  volatile uint32_t uartf_errorcnt_rxoverrun;
  #endif
#endif


#if defined UARTF_USE_UART1 || defined UARTF_USE_UART1_REMAPPED || defined UARTF_USE_UART1_REMAPPED2
  #define UARTF_UARTx             USART1
  #ifdef UARTF_USE_UART1
    #define UARTF_TX_IO           IO_PA9
    #define UARTF_RX_IO           IO_PA10
  #elif defined UARTF_USE_UART1_REMAPPED
    #define UARTF_TX_IO           IO_PB6
    #define UARTF_RX_IO           IO_PB7
  #elif defined UARTF_USE_UART1_REMAPPED2 // only G4
    #define UARTF_TX_IO           IO_PC4 // on G4
    #define UARTF_RX_IO           IO_PC5
  #endif
  #ifndef STM32F0
    #define UARTF_IO_AF           IO_AF_7
  #else
    #if defined UARTF_USE_UART1
      #define UARTF_IO_AF         IO_AF_1
    #elif defined UARTF_USE_UART1_REMAPPED
      #define UARTF_IO_AF         IO_AF_0
	#else  
      #error UARTF_USE_UART1 mapping not available on STM32F0 !
	#endif  
  #endif
  #define UARTF_IRQn              USART1_IRQn
  #define UARTF_IRQHandler        USART1_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #endif

#elif defined UARTF_USE_UART2 || defined UARTF_USE_UART2_REMAPPED || defined UARTF_USE_UART2_REMAPPED2 || defined UARTF_USE_UART2_REMAPPED3
  #define UARTF_UARTx             USART2
  #ifdef UARTF_USE_UART2
    #define UARTF_TX_IO           IO_PA2
    #define UARTF_RX_IO           IO_PA3
  #elif defined UARTF_USE_UART2_REMAPPED
    #define UARTF_TX_IO           IO_PD5
    #define UARTF_RX_IO           IO_PD6
  #elif defined UARTF_USE_UART2_REMAPPED2 // only G4
    #define UARTF_TX_IO           IO_PB3
    #define UARTF_RX_IO           IO_PB4
  #elif defined UARTF_USE_UART2_REMAPPED3 // only G4, F0 // ATTENTION: on G4 PA14 overlaps with SWCLK
    #define UARTF_TX_IO           IO_PA14
    #define UARTF_RX_IO           IO_PA15
  #endif
  #ifndef STM32F0
    #define UARTF_IO_AF           IO_AF_7
  #else
    #if defined UARTF_USE_UART2 || defined UARTF_USE_UART2_REMAPPED3
      #define UARTF_IO_AF         IO_AF_1
	#else  
      #error UARTF_USE_UART2 mapping not available on STM32F0 !
	#endif  
  #endif
  #define UARTF_IRQn              USART2_IRQn
  #define UARTF_IRQHandler        USART2_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #endif

