olliw42/stm32ll-lib/src/stdstm32-uartf.h
void UARTF_IRQHandler(void)
{
  // Cube HAL for f103rc is also calling this first independent on irqs
  uint16_t usart_sr = LL_USART_ReadReg(UARTF_UARTx, REG_SR); // read USART_SR register

#ifdef UARTF_USE_RX
  if ((usart_sr & FLAG_SR_RXNE) && LL_USART_IsEnabledIT_RXNE(UARTF_UARTx)) {
#ifdef UARTF_USE_RXERRORCOUNT
    if (usart_sr & FLAG_SR_ORE) uartf_errorcnt_rxoverrun++;
    if (usart_sr & FLAG_SR_NE) uartf_errorcnt_rxnoise++;
    if (usart_sr & FLAG_SR_FE) uartf_errorcnt_rxframe++;
#endif
    // Cube LL driver (for f103?) says that reading SR and then writing to DR will clear error flags, so do it after error checks
    uint8_t usart_dr = LL_USART_ReceiveData8(UARTF_UARTx); // read USART_DR register, clears RXNE and RX error flags
#ifdef UARTF_RX_CALLBACK_FULL
    UARTF_RX_CALLBACK_FULL(usart_dr);
#else
    uint16_t next = (uartf_rxwritepos + 1) & UARTF_RXBUFSIZEMASK;
    if (uartf_rxreadpos != next) { // fifo not full
      uartf_rxbuf[next] = usart_dr;
      uartf_rxwritepos = next;
    }
#endif
  }
#if defined STM32F1
  // ORE is enabled along with RXNE, so we need to handle it
  // ORE bit is reset by read to USART_SR followed by read to USART_DR
  if (usart_sr & FLAG_SR_ORE) {
    LL_USART_ReceiveData8(UARTF_UARTx); // read USART_DR register, clears RXNE and RX error flags
  }
#elif defined STM32F3
  // ORE is enabled along with RXNE, but can be cleared by writing 1 to ICR
  LL_USART_WriteReg(UARTF_UARTx, ICR, (LL_USART_ICR_IDLECF | LL_USART_ICR_ORECF | LL_USART_ICR_NCF | LL_USART_ICR_FECF | LL_USART_ICR_PECF));
#elif defined STM32F7
  #warning UARTF F7 check clear flags, should be LL !?
  // these are cleared by write 1 to the ICR register, not by a read of DR register!
  LL_USART_WriteReg(UARTF_UARTx, ICR, (USART_ICR_IDLECF | USART_ICR_ORECF | USART_ICR_NCF | USART_ICR_FECF | USART_ICR_PECF));
#elif defined STM32G4 || defined STM32L4 || defined STM32WL
  LL_USART_WriteReg(UARTF_UARTx, ICR, (LL_USART_ICR_IDLECF | LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_FECF | LL_USART_ICR_PECF));
#endif
#endif

#ifdef UARTF_USE_TX_ISR
  if ((usart_sr & FLAG_SR_TXE) && LL_USART_IsEnabledIT_TXE(UARTF_UARTx)) {
    if (uartf_txwritepos != uartf_txreadpos) { // fifo not empty
      uartf_txreadpos = (uartf_txreadpos + 1) & UARTF_TXBUFSIZEMASK;
      LL_USART_TransmitData8(UARTF_UARTx, uartf_txbuf[uartf_txreadpos]); // write to USART_DR register, clears TXE flag, as well as TC
    } else {
      LL_USART_DisableIT_TXE(UARTF_UARTx); // disable interrupt when empty
#ifdef UARTF_TC_CALLBACK
      // ATTENTION: doesn't distinguish between empty fifo and last byte just send!
      LL_USART_ClearFlag_TC(UARTF_UARTx); // now enable TC interrupt
      LL_USART_EnableIT_TC(UARTF_UARTx);
#endif
    }
  }

#ifdef UARTF_TC_CALLBACK
  if ((usart_sr & FLAG_SR_TC) && LL_USART_IsEnabledIT_TC(UARTF_UARTx)) {
    LL_USART_DisableIT_TC(UARTF_UARTx);
    LL_USART_ClearFlag_TC(UARTF_UARTx);
    UARTF_TC_CALLBACK();
  }
#endif
#endif
}

#endif // defined UARTF_USE_RX || defined UARTF_USE_TX_ISR


//-------------------------------------------------------
// TX routines
//-------------------------------------------------------
#ifdef UARTF_USE_TX

uint16_t uartf_putc(char c)
{
#ifndef UARTF_USE_TX_ISR
  while (!LL_USART_IsActiveFlag_TC(UARTF_UARTx)) {}
  LL_USART_TransmitData8(UARTF_UARTx, c);
  return 1;
#else
  uint16_t next = (uartf_txwritepos + 1) & UARTF_TXBUFSIZEMASK;
  if (uartf_txreadpos != next) { // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
    uartf_txbuf[next] = c;
    uartf_txwritepos = next;
    LL_USART_EnableIT_TXE(UARTF_UARTx); // enable interrupt // then TDR is empty, the TXE bit is set, and hence the isr is triggered
    return 1;
  }
  return 0;
#endif
}


void uartf_puts(const char *s)
{
  while (*s) {
    uartf_putc(*s);
    s++;
  }
}


void uartf_putbuf(uint8_t* buf, uint16_t len)
{
uint16_t i;

  for (i = 0; i < len; i++) uartf_putc(buf[i]);
}


#ifdef UARTF_USE_TX_ISR
uint16_t uartf_tx_notfull(void)
{
  uint16_t next = (uartf_txwritepos + 1) & UARTF_TXBUFSIZEMASK;
  return (uartf_txreadpos != next); // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
}


static inline uint16_t uartf_tx_isempty(void)
{
  if (uartf_txwritepos == uartf_txreadpos) return 1;
  return 0;
}


static inline void uartf_tx_flush(void)
{
  uartf_txwritepos = uartf_txreadpos = 0;
}
#else
static inline void uartf_tx_flush(void) {}
#endif

#endif // defined UARTF_USE_TX


//-------------------------------------------------------
// RX routines
//-------------------------------------------------------
#ifdef UARTF_USE_RX

static inline uint16_t uartf_rx_available(void)
{
  if (uartf_rxwritepos == uartf_rxreadpos) return 0; // fifo empty
  return 1;
}


uint16_t uartf_rx_bytesavailable(void)
{
int16_t d;

  d = (int16_t)uartf_rxwritepos - (int16_t)uartf_rxreadpos;
  return (d < 0) ? d + (UARTF_RXBUFSIZEMASK + 1) : d;
}


char uartf_getc(void)
{
  while (uartf_rxwritepos == uartf_rxreadpos) {};
  uartf_rxreadpos = (uartf_rxreadpos + 1) & UARTF_RXBUFSIZEMASK;
  return uartf_rxbuf[uartf_rxreadpos];
}


static inline char uartf_lookatnextc(void)
{
  return uartf_rxbuf[(uartf_rxreadpos + 1) & UARTF_RXBUFSIZEMASK];
}


static inline void uartf_rx_flush(void)
{
  uartf_rxwritepos = uartf_rxreadpos = 0;
}

#endif // defined UARTF_USE_RX


//-------------------------------------------------------
// INIT routines
//-------------------------------------------------------
// ATTENTION:
// LPUART does not support 0.5 or 1.5 stop bits !!

// helper, usually should not be called itself
void _uartf_initprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UARTF_USE_LPUART1 || defined UARTF_USE_LPUART1_REMAPPED)
LL_USART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != XUART_PARITY_NO) ? LL_USART_DATAWIDTH_9B : LL_USART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
  UART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
#if defined STM32G4
  UART_InitStruct.PrescalerValue = LL_USART_PRESCALER_DIV1;
#endif

  LL_USART_Init(UARTF_UARTx, &UART_InitStruct);
#else
LL_LPUART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != LL_USART_PARITY_NONE) ? LL_LPUART_DATAWIDTH_9B : LL_LPUART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_LPUART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_LPUART_HWCONTROL_NONE;
  UART_InitStruct.PrescalerValue = LL_LPUART_PRESCALER_DIV1;

